
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.repos["terraform-cloudflare"] will be created
  + resource "github_repository" "repos" {
      + allow_auto_merge                        = true
      + allow_merge_commit                      = false
      + allow_rebase_merge                      = true
      + allow_squash_merge                      = true
      + allow_update_branch                     = true
      + archived                                = false
      + default_branch                          = (known after apply)
      + delete_branch_on_merge                  = true
      + description                             = "Terraform configuration for Cloudflare"
      + etag                                    = (known after apply)
      + full_name                               = (known after apply)
      + git_clone_url                           = (known after apply)
      + has_issues                              = false
      + has_projects                            = false
      + has_wiki                                = false
      + html_url                                = (known after apply)
      + http_clone_url                          = (known after apply)
      + id                                      = (known after apply)
      + ignore_vulnerability_alerts_during_read = true
      + is_template                             = false
      + merge_commit_message                    = "PR_TITLE"
      + merge_commit_title                      = "MERGE_MESSAGE"
      + name                                    = "terraform-cloudflare"
      + node_id                                 = (known after apply)
      + private                                 = (known after apply)
      + repo_id                                 = (known after apply)
      + squash_merge_commit_message             = "COMMIT_MESSAGES"
      + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url                           = (known after apply)
      + svn_url                                 = (known after apply)
      + visibility                              = "private"

      + template {
          + include_all_branches = false
          + owner                = "surefirev2"
          + repository           = "template-1-terraform"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ repository_names = {
      + terraform-cloudflare  = (known after apply)
        # (16 unchanged attributes hidden)
    }
  ~ repository_urls  = {
      + terraform-cloudflare  = (known after apply)
        # (16 unchanged attributes hidden)
    }

<!-- Sticky Pull Request Commentterraform-plan -->